import React, { Component } from 'react';

import './homepage.css';

export default class Homepage extends Component {
    render() {
        return (
            <div className="container homepage">
                {/* <h1>Теорія прийняття рішень</h1>
                <h3>Лабораторна робота</h3>
                <h4>Методи Байєса і Гурвіца</h4>
                <h6>Виконали студенти групи ПА-18-3</h6>
                <h6>Ткачов Костянтин Вадимович, Удалов Михайло Михайлович, Чорний Максим Андрійович</h6> */}

                <p>Розглянемо клас задач, у яких рішення приймає одна із сторін за умови, коли немає усвідомленої протидії. Такі задачі відносять до класу <b>ігор проти природи.</b></p>
                <p>У дискретному випадку вважається, що рішення (стратегія) вибирається із скінченної множини, а фактори, що можуть впливати на результат вибору, 
                мають скінченну кількість станів.</p>
                <p><strong>Означення 1.1</strong></p>
                <p><strong>Нерандомізованим розв’язком</strong> &alpha;<sub>i</sub> називається будь-яка стратегія особи, яка приймає рішення.</p>
                <p><strong>Означення 1.2</strong></p>
                <p><strong>Критерій оптимальності</strong> це правило, яке дозволяє із двох нерандомізованих розв’язків &alpha;<sub>i</sub> і &alpha;<sub>j</sub> визначити кращий.</p>
                <p><strong>Означення 1.3</strong></p>
                <p><strong>Матрицею втрат</strong> називають матрицю L = &#123;l<sub>ij</sub>&#125;<sub>m&#215;n</sub> , кожен елемент l<sub>ij</sub> якої відповідає втратам, 
                що зазнає особа, яка обрала стратегію &alpha;<sub>i</sub>, якщо природа буде знаходитися в стані &beta;<sub>j</sub>.</p>
                <p><strong>Означення 1.4</strong></p>
                <p><strong>Матрицею корисності</strong> називають матрицю Q = &#123;q<sub>ij</sub>&#125;<sub>m&#215;n</sub> , кожен елемент q<sub>ij</sub> якої відповідає втратам, 
                що зазнає особа, яка обрала стратегію &alpha;<sub>i</sub>, якщо природа буде знаходитися в стані &beta;<sub>j</sub>.</p>
                <p>Слід відзначити, що елементи матриць та є суб’єктивні, тобто для двох різних осіб вони можуть бути різними.</p>
                <p>Елементи матриці втрат і матриці корисності пов’язані між собою таким чином:
                l<sub>ij</sub>=max<sub>i, j</sub>q<sub>ij</sub> - q<sub>ij</sub>.</p>
                <p>Зазвичай на практиці застосовують такі критерії оптимальності:</p>
                <ul>
                    <li>Мінімаксний критерій.</li>
                    <li>Критерій Севіджа.</li>
                    <li>Критерій Гурвіца</li>
                    <li>Критерій Байєса.</li>
                    <li>Критерій Неймана–Пірсона.</li>
                </ul>
                <p>Усі ці критерії застосовуються до матриці втрат.</p>
                <p><strong>Означення 1.5</strong></p>
                <p><strong>Рандомізованим розв’язком</strong> X називається розподіл імовірностей на множині нерандомізованих розв’язків, 
                тобто X=&#123;(x<sub>1</sub>,x<sub>2</sub>,...,x<sub>m</sub>):x<sub>i</sub>&ge;0,<sub>i=1</sub>&sum;<sup>m</sup>x<sub>i</sub>=1&#125;, 
                де x<sub>i</sub> – імовірність вибору нерандомізованого розв’язку &alpha;<sub>i</sub>.</p>
                <p>Нехай природа може знаходитись в одному із двох станів, тоді матриці втрат матиме вигляд</p>
                <div style={{paddingLeft:'83px'}}>(l<sub>11</sub> l<sub>12</sub>)</div>
                <div style={{paddingLeft:'83px'}}>(l<sub>21</sub> l<sub>22</sub>)</div>
                <div>L = &#123;l<sub>ij</sub>&#125;<sub>n&#215;2</sub>=(...&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;...)</div>
                <div style={{paddingLeft:'83px'}}>(l<sub>n1</sub> l<sub>n2</sub>)</div>
                <p>Розглянемо декартову систему координат, де по осі абсцис відкладаються втрати в разі першого стану природи, а по осі ординат – у разі другого. 
                Тоді точки в цій системі координат задаватимуть конкретний нерандомізований розв’язок.</p>
                <p>Оскільки рандомізований розв’язок – це розподіл імовірностей на множині нерандомізованих розв’язків, то, 
                зафіксувавши будь-які два нерандомізованих розв’язки &alpha;<sub>i</sub> та &alpha;<sub>j</sub> , 
                ми одержимо множину всіх рандомізованих розв’язків, що зумовлюються даними нерандомізованими розв’язками. 
                Цим рандомізованим розв’язкам будуть відповідати точки на відрізку, 
                що поєднує точки &alpha;<sub>i</sub> (l<sub>i1</sub>, l<sub>i2</sub>) та &alpha;<sub>j</sub> (l<sub>j1</sub>, l<sub>j2</sub>). </p>
                <p>Перебравши всі можливі пари нерандомізованих розв’язків, ми одержимо всі множини рандомізованих розв’язків.</p>
                <p><strong>Означення 1.6</strong></p>
                <p>Геометричне місце точок, що відповідають рандомізованим розв’язкам, називають <strong>платіжною множиною</strong> D.</p>
                <p>Геометрична інтерпретація критеріїв оптимальності зводиться до того, щоб визначити, яка саме точка платіжної множини є оптимальна, 
                а знайти рандомізований розв’язок за тим чи іншим критерієм означає знайти точку платіжної множини, що є оптимальною за цим критерієм.</p>
                <p>У цій лабораторній роботі будуть розглядатися методи Байєса і Гурвіца.</p>
            </div>
        );
    }
};